INSERT INTO doll_shop (approval_date,is_operating,latitude,longitude,total_game_machines,id,gubun1,gubun2,phone,image_path,address,business_name) VALUES
	 ('2025-08-25',1,37.5548849,126.9054233,0,857,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 포은로 88, 1층 (망원동)','하이캐치 망원점'),
	 ('2025-07-16',1,37.5514054,126.9215967,0,893,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 70, 서포빌딩 지하1층 (서교동)','FunCity 펀시티'),
	 ('2025-07-10',1,37.5498159,126.9207941,0,899,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 51-1, 1층 102호 (서교동)','레미오(Remio)'),
	 ('2025-07-09',1,37.5777333,126.8954478,0,900,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 매봉산로2길 34, 1층 (상암동)','뽀뽑기'),
	 ('2025-06-12',1,37.5422361,126.9518559,0,921,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 새창로 15-1, 1층 (도화동)','럭키캐치 공덕역점'),
	 ('2025-05-15',1,37.5611629,126.9245339,0,948,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 238-1, 호원빌딩 1층 (연남동)','대빵인형뽑기 연남점'),
	 ('2025-05-01',1,37.5479386,126.9227739,0,958,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 독막로 85, 1층 (상수동)','캐칭덕 상수점'),
	 ('2025-04-30',1,37.5576431,126.9083658,0,959,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 월드컵로 103, 1층 (망원동)','럭키캐치'),
	 ('2025-04-23',1,37.5501152069,126.9146381804,0,965,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 양화로 지하 55, 합정역 지하1층 238-113호 (서교동)','퍼니랜드'),
	 ('2025-04-17',1,37.55721,126.9236934,0,970,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 양화로 165, 1층 (동교동)','미니돌 홍대점');
INSERT INTO doll_shop (approval_date,is_operating,latitude,longitude,total_game_machines,id,gubun1,gubun2,phone,image_path,address,business_name) VALUES
	 ('2025-04-07',1,37.5600296,126.9240628,0,984,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 226, 1층 (동교동)','힙플조이'),
	 ('2025-03-27',1,37.5484831,126.9196109,0,990,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 독막로9길 4, 101-102호 (서교동)','블링팝'),
	 ('2024-12-23',1,37.5557561,126.9096394,0,1042,'서울특별시','마포구','032-675-0546',NULL,'서울특별시 마포구 월드컵로13길 12, 1층 (망원동)','퍼니랜드 망원동점'),
	 ('2024-09-12',1,37.5518399,126.9217135,34,1099,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 76-1, 석영빌딩 1층 (서교동)','모모스테이션 홍대점'),
	 ('2024-09-09',1,37.557382,126.9283473,30,1102,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 신촌로4길 14, 1층 (동교동)','퍼니랜드'),
	 ('2024-09-06',1,37.5586781,126.9257853,0,1103,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 양화로 191, 1층 (동교동)','캐칭돌'),
	 ('2024-09-04',1,37.5504001,126.9214107,46,1104,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 60, 제이투에스빌딩 1,2층 (서교동)','R5 게임즈'),
	 ('2024-05-28',1,37.5614111,126.9244905,0,1143,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 242, 1층 (연남동)','찌꼬뽀꼬 연남점2'),
	 ('2024-03-27',1,37.5515925,126.9216611,0,1156,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 74, 금광빌딩 B02호 (서교동)','얼짱캐칭덕'),
	 ('2023-12-27',1,37.5614852,126.9241427,0,1167,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 241, 연남파크빌딩 1층 (연남동)','RAINBOW CASTLE');
INSERT INTO doll_shop (approval_date,is_operating,latitude,longitude,total_game_machines,id,gubun1,gubun2,phone,image_path,address,business_name) VALUES
	 ('2023-12-14',1,37.5617067,126.9241585,0,1168,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 243, 1층 (연남동)','찌꼬뽀꼬 연남점'),
	 ('2023-11-17',1,37.5479895,126.9207535,0,1171,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 독막로 65, 1층 (상수동)','당근 오락실'),
	 ('2022-03-15',1,37.5522424,126.9227155,26,1205,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 와우산로21길 21, 1층 (서교동)','몽키샵'),
	 ('2019-03-21',1,37.5510564,126.9218838,0,1298,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 잔다리로 12, 홍석빌딩 5층 (서교동)','라운지 플스방'),
	 ('2017-07-14',1,37.5486379,126.9398538,7,1387,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 백범로 74, 1층 (신수동)','꿀잼#'),
	 ('2017-05-04',1,37.5546965,126.932622,11,1405,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 와우산로32길 42, 1층 (서교동)','몬스터킹 2호점'),
	 ('2017-03-30',1,37.55327,126.9060334,7,1422,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 포은로 67, 1층 3호 (망원동)','뽑아가게'),
	 ('2017-03-08',1,37.5773822,126.895264,8,1436,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 월드컵북로48길 31, 1층 (상암동)','인형뽑기놀이터'),
	 ('2017-01-05',1,37.5622515,126.9245654,10,1473,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 동교로 250, 1층 (연남동, 약국빌딩)','인형아 잘가'),
	 ('2016-11-28',1,37.5514041,126.9217833,0,1495,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 와우산로19길 26, 1층 (서교동)','아이돌뽑기팡');
INSERT INTO doll_shop (approval_date,is_operating,latitude,longitude,total_game_machines,id,gubun1,gubun2,phone,image_path,address,business_name) VALUES
	 ('2025-09-17',0,37.5780033,126.8954339,0,6330,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 매봉산로2길 27, 1층 (상암동)','쿠보'),
	 ('2025-09-17',0,37.56196,126.9270002,0,6331,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 연희로 35, 1층 102호 (연남동)','고미모리 연남점'),
	 ('2025-10-01',0,37.5417817,126.9502838,0,6454,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 도화길 43, 나눔빌딩 110호 (도화동)','버블팝'),
	 ('2025-10-01',0,37.5525232,126.9218314,0,6471,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 와우산로21길 36-3, 태윤빌딩 1층 (서교동)','지지게임존'),
	 ('2025-11-02',0,37.5546792,126.9297783,0,6603,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 와우산로 151, 1층 (서교동)','지지게임존 홍대2호점'),
	 ('2025-11-12',0,37.5505658,126.9214491,0,6730,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 62, 1층 (서교동)','캑티 가챠샵 홍대점'),
	 ('2025-12-06',0,37.5517385,126.9216581,0,6792,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 어울마당로 76, 1층 (서교동)','최강오락실'),
	 ('2025-12-16',0,37.5563506,126.8991535,0,6894,'서울특별시','마포구',NULL,NULL,'서울특별시 마포구 망원로 19, 1층 108호 (망원동, 참존아파트)','러키비키 망원한강공원점');
